Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_FLEXRAM.h
#define FLEXRAM_D1TCM_ECC_MULTI_ERROR_ADDR_D1TCM_ECCM_ERRED_ADDR_MASK (0xFFFFFFFFU)
#define FLEXRAM_D1TCM_ECC_MULTI_ERROR_ADDR_D1TCM_ECCM_ERRED_ADDR_SHIFT (0U)
/*! D1TCM_ECCM_ERRED_ADDR - D1TCM multi-bit ECC error address */
#define FLEXRAM_D1TCM_ECC_MULTI_ERROR_ADDR_D1TCM_ECCM_ERRED_ADDR(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_MULTI_ERROR_ADDR_D1TCM_ECCM_ERRED_ADDR_SHIFT)) & FLEXRAM_D1TCM_ECC_MULTI_ERROR_ADDR_D1TCM_ECCM_ERRED_ADDR_MASK)
/*! @} */

/*! @name D1TCM_ECC_MULTI_ERROR_DATA - D1TCM multi-bit ECC Error Data Register */
/*! @{ */

#define FLEXRAM_D1TCM_ECC_MULTI_ERROR_DATA_D1TCM_ECCM_ERRED_DATA_MASK (0xFFFFFFFFU)
#define FLEXRAM_D1TCM_ECC_MULTI_ERROR_DATA_D1TCM_ECCM_ERRED_DATA_SHIFT (0U)
/*! D1TCM_ECCM_ERRED_DATA - D1TCM multi-bit ECC error data */
#define FLEXRAM_D1TCM_ECC_MULTI_ERROR_DATA_D1TCM_ECCM_ERRED_DATA(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_MULTI_ERROR_DATA_D1TCM_ECCM_ERRED_DATA_SHIFT)) & FLEXRAM_D1TCM_ECC_MULTI_ERROR_DATA_D1TCM_ECCM_ERRED_DATA_MASK)
/*! @} */

/*! @name OCRAM_ECC_ERROR_INJEC - OCRAM ECC Error Injection Register */
/*! @{ */

#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR1BIT_MASK (0xFFU)
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR1BIT_SHIFT (0U)
/*! OCRAM_ERR1BIT - Bit position of the bit to inject ECC Error. Can be used for single-bit and multi-bit ECC Error injection. */
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR1BIT(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR1BIT_SHIFT)) & FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR1BIT_MASK)

#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR2BIT_MASK (0xFF00U)
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR2BIT_SHIFT (8U)
/*! OCRAM_ERR2BIT - Bit position of the second bit to inject multi-bit ECC Error. */
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR2BIT(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR2BIT_SHIFT)) & FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_ERR2BIT_MASK)

#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR11BI_MASK (0x10000U)
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR11BI_SHIFT (16U)
/*! OCRAM_FR11BI - Force One 1-Bit Data Inversion (single-bit ECC error) on OCRAM write access */
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR11BI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR11BI_SHIFT)) & FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR11BI_MASK)

#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR1NCI_MASK (0x20000U)
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR1NCI_SHIFT (17U)
/*! OCRAM_FR1NCI - Force One Non-correctable Data Inversion(multi-bit ECC error) on OCRAM write access */
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR1NCI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR1NCI_SHIFT)) & FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FR1NCI_MASK)

#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRC1BI_MASK (0x40000U)
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRC1BI_SHIFT (18U)
/*! OCRAM_FRC1BI - Force Continuous 1-Bit Data Inversions (single-bit ECC error) on OCRAM write access */
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRC1BI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRC1BI_SHIFT)) & FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRC1BI_MASK)

#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRCNCI_MASK (0x80000U)
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRCNCI_SHIFT (19U)
/*! OCRAM_FRCNCI - Force Continuous Non-correctable Data Inversions (multi-bit ECC error) on OCRAM write access */
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRCNCI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRCNCI_SHIFT)) & FLEXRAM_OCRAM_ECC_ERROR_INJEC_OCRAM_FRCNCI_MASK)

#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_Reserved_MASK (0xFFF00000U)
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_Reserved_SHIFT (20U)
/*! Reserved - Reserved */
#define FLEXRAM_OCRAM_ECC_ERROR_INJEC_Reserved(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_OCRAM_ECC_ERROR_INJEC_Reserved_SHIFT)) & FLEXRAM_OCRAM_ECC_ERROR_INJEC_Reserved_MASK)
/*! @} */

/*! @name ITCM_ECC_ERROR_INJEC - ITCM ECC Error Injection Register */
/*! @{ */

#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR1BIT_MASK (0xFFU)
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR1BIT_SHIFT (0U)
/*! ITCM_ERR1BIT - Bit position of the bit to inject ECC Error. Can be used for single-bit and multi-bit ECC Error injection. */
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR1BIT(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR1BIT_SHIFT)) & FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR1BIT_MASK)

#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR2BIT_MASK (0xFF00U)
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR2BIT_SHIFT (8U)
/*! ITCM_ERR2BIT - Bit position of the second bit to inject multi-bit ECC Error. */
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR2BIT(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR2BIT_SHIFT)) & FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_ERR2BIT_MASK)

#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR11BI_MASK (0x10000U)
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR11BI_SHIFT (16U)
/*! ITCM_FR11BI - Force One 1-Bit Data Inversion(single-bit ECC error) on ITCM write access */
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR11BI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR11BI_SHIFT)) & FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR11BI_MASK)

#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR1NCI_MASK (0x20000U)
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR1NCI_SHIFT (17U)
/*! ITCM_FR1NCI - Force One Non-correctable Data Inversion(multi-bit ECC error) on ITCM write access */
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR1NCI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR1NCI_SHIFT)) & FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FR1NCI_MASK)

#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRC1BI_MASK (0x40000U)
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRC1BI_SHIFT (18U)
/*! ITCM_FRC1BI - Force Continuous 1-Bit Data Inversions (single-bit ECC error) on ITCM write access */
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRC1BI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRC1BI_SHIFT)) & FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRC1BI_MASK)

