Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_FLEXRAM.h
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRCNCI_MASK (0x80000U)
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRCNCI_SHIFT (19U)
/*! ITCM_FRCNCI - Force Continuous Non-correctable Data Inversions (multi-bit ECC error) on ITCM write access */
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRCNCI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRCNCI_SHIFT)) & FLEXRAM_ITCM_ECC_ERROR_INJEC_ITCM_FRCNCI_MASK)

#define FLEXRAM_ITCM_ECC_ERROR_INJEC_Reserved_MASK (0xFFF00000U)
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_Reserved_SHIFT (20U)
/*! Reserved - Reserved */
#define FLEXRAM_ITCM_ECC_ERROR_INJEC_Reserved(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_ITCM_ECC_ERROR_INJEC_Reserved_SHIFT)) & FLEXRAM_ITCM_ECC_ERROR_INJEC_Reserved_MASK)
/*! @} */

/*! @name D0TCM_ECC_ERROR_INJEC - D0TCM ECC Error Injection Register */
/*! @{ */

#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR1BIT_MASK (0xFFU)
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR1BIT_SHIFT (0U)
/*! D0TCM_ERR1BIT - Bit position of the bit to inject ECC Error. Can be used for single-bit and multi-bit ECC Error injection. */
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR1BIT(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR1BIT_SHIFT)) & FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR1BIT_MASK)

#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR2BIT_MASK (0xFF00U)
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR2BIT_SHIFT (8U)
/*! D0TCM_ERR2BIT - Bit position of the second bit to inject multi-bit ECC Error */
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR2BIT(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR2BIT_SHIFT)) & FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_ERR2BIT_MASK)

#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR11BI_MASK (0x10000U)
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR11BI_SHIFT (16U)
/*! D0TCM_FR11BI - Force One 1-Bit Data Inversion(single-bit ECC error) on D0TCM write access */
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR11BI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR11BI_SHIFT)) & FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR11BI_MASK)

#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR1NCI_MASK (0x20000U)
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR1NCI_SHIFT (17U)
/*! D0TCM_FR1NCI - Force One Non-correctable Data Inversion(multi-bit ECC error) on D0TCM write access */
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR1NCI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR1NCI_SHIFT)) & FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FR1NCI_MASK)

#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRC1BI_MASK (0x40000U)
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRC1BI_SHIFT (18U)
/*! D0TCM_FRC1BI - Force Continuous 1-Bit Data Inversions (single-bit ECC error) on D0TCM write access */
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRC1BI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRC1BI_SHIFT)) & FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRC1BI_MASK)

#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRCNCI_MASK (0x80000U)
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRCNCI_SHIFT (19U)
/*! D0TCM_FRCNCI - Force Continuous Non-correctable Data Inversions (multi-bit ECC error) on D0TCM write access */
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRCNCI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRCNCI_SHIFT)) & FLEXRAM_D0TCM_ECC_ERROR_INJEC_D0TCM_FRCNCI_MASK)

#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_Reserved_MASK (0xFFF00000U)
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_Reserved_SHIFT (20U)
/*! Reserved - Reserved */
#define FLEXRAM_D0TCM_ECC_ERROR_INJEC_Reserved(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D0TCM_ECC_ERROR_INJEC_Reserved_SHIFT)) & FLEXRAM_D0TCM_ECC_ERROR_INJEC_Reserved_MASK)
/*! @} */

/*! @name D1TCM_ECC_ERROR_INJEC - D1TCM ECC Error Injection Register */
/*! @{ */

#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR1BIT_MASK (0xFFU)
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR1BIT_SHIFT (0U)
/*! D1TCM_ERR1BIT - Bit position of the bit to inject ECC Error. Can be used for single-bit and multi-bit ECC Error injection */
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR1BIT(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR1BIT_SHIFT)) & FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR1BIT_MASK)

#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR2BIT_MASK (0xFF00U)
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR2BIT_SHIFT (8U)
/*! D1TCM_ERR2BIT - Bit position of the second bit to inject multi-bit ECC Error */
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR2BIT(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR2BIT_SHIFT)) & FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_ERR2BIT_MASK)

#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR11BI_MASK (0x10000U)
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR11BI_SHIFT (16U)
/*! D1TCM_FR11BI - Force One 1-Bit Data Inversion(single-bit ECC error) on D1TCM write access */
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR11BI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR11BI_SHIFT)) & FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR11BI_MASK)

#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR1NCI_MASK (0x20000U)
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR1NCI_SHIFT (17U)
/*! D1TCM_FR1NCI - Force One Non-correctable Data Inversion(multi-bit ECC error) on D1TCM write access */
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR1NCI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR1NCI_SHIFT)) & FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FR1NCI_MASK)

#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRC1BI_MASK (0x40000U)
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRC1BI_SHIFT (18U)
/*! D1TCM_FRC1BI - Force Continuous 1-Bit Data Inversions (single-bit ECC error) on D1TCM write access */
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRC1BI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRC1BI_SHIFT)) & FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRC1BI_MASK)

#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRCNCI_MASK (0x80000U)
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRCNCI_SHIFT (19U)
/*! D1TCM_FRCNCI - Force Continuous Non-correctable Data Inversions (multi-bit ECC error) on D1TCM write access */
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRCNCI(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRCNCI_SHIFT)) & FLEXRAM_D1TCM_ECC_ERROR_INJEC_D1TCM_FRCNCI_MASK)

#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_Reserved_MASK (0xFFF00000U)
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_Reserved_SHIFT (20U)
/*! Reserved - Reserved */
#define FLEXRAM_D1TCM_ECC_ERROR_INJEC_Reserved(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_D1TCM_ECC_ERROR_INJEC_Reserved_SHIFT)) & FLEXRAM_D1TCM_ECC_ERROR_INJEC_Reserved_MASK)
/*! @} */

/*! @name FLEXRAM_CTRL - FlexRAM feature Control register */
/*! @{ */

#define FLEXRAM_FLEXRAM_CTRL_OCRAM_RDATA_WAIT_EN_MASK (0x1U)
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_RDATA_WAIT_EN_SHIFT (0U)
/*! OCRAM_RDATA_WAIT_EN - Read Data Wait Enable */
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_RDATA_WAIT_EN(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_FLEXRAM_CTRL_OCRAM_RDATA_WAIT_EN_SHIFT)) & FLEXRAM_FLEXRAM_CTRL_OCRAM_RDATA_WAIT_EN_MASK)

#define FLEXRAM_FLEXRAM_CTRL_OCRAM_RADDR_PIPELINE_EN_MASK (0x2U)
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_RADDR_PIPELINE_EN_SHIFT (1U)
/*! OCRAM_RADDR_PIPELINE_EN - Read Address Pipeline Enable */
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_RADDR_PIPELINE_EN(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_FLEXRAM_CTRL_OCRAM_RADDR_PIPELINE_EN_SHIFT)) & FLEXRAM_FLEXRAM_CTRL_OCRAM_RADDR_PIPELINE_EN_MASK)

#define FLEXRAM_FLEXRAM_CTRL_OCRAM_WRDATA_PIPELINE_EN_MASK (0x4U)
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_WRDATA_PIPELINE_EN_SHIFT (2U)
/*! OCRAM_WRDATA_PIPELINE_EN - Write Data Pipeline Enable */
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_WRDATA_PIPELINE_EN(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_FLEXRAM_CTRL_OCRAM_WRDATA_PIPELINE_EN_SHIFT)) & FLEXRAM_FLEXRAM_CTRL_OCRAM_WRDATA_PIPELINE_EN_MASK)

#define FLEXRAM_FLEXRAM_CTRL_OCRAM_WRADDR_PIPELINE_EN_MASK (0x8U)
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_WRADDR_PIPELINE_EN_SHIFT (3U)
/*! OCRAM_WRADDR_PIPELINE_EN - Write Address Pipeline Enable */
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_WRADDR_PIPELINE_EN(x) (((uint32_t)(((uint32_t)(x)) << FLEXRAM_FLEXRAM_CTRL_OCRAM_WRADDR_PIPELINE_EN_SHIFT)) & FLEXRAM_FLEXRAM_CTRL_OCRAM_WRADDR_PIPELINE_EN_MASK)

#define FLEXRAM_FLEXRAM_CTRL_OCRAM_ECC_EN_MASK   (0x10U)
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_ECC_EN_SHIFT  (4U)
/*! OCRAM_ECC_EN - OCRAM ECC enable */
#define FLEXRAM_FLEXRAM_CTRL_OCRAM_ECC_EN(x)     (((uint32_t)(((uint32_t)(x)) << FLEXRAM_FLEXRAM_CTRL_OCRAM_ECC_EN_SHIFT)) & FLEXRAM_FLEXRAM_CTRL_OCRAM_ECC_EN_MASK)

#define FLEXRAM_FLEXRAM_CTRL_TCM_ECC_EN_MASK     (0x20U)
#define FLEXRAM_FLEXRAM_CTRL_TCM_ECC_EN_SHIFT    (5U)
/*! TCM_ECC_EN - TCM ECC enable */
#define FLEXRAM_FLEXRAM_CTRL_TCM_ECC_EN(x)       (((uint32_t)(((uint32_t)(x)) << FLEXRAM_FLEXRAM_CTRL_TCM_ECC_EN_SHIFT)) & FLEXRAM_FLEXRAM_CTRL_TCM_ECC_EN_MASK)

